run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/bezGM/SlawekTestCase1DSuperFluidWall_DirichletBC_1.954K/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    UP
    {
        type            superFluidWallUs;
        value           uniform (0 0 0);
    }
    DOWN
    {
        type            superFluidWallUs;
        value           uniform (0 0 0);
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            superFluidWallUs;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
